export default function () {
const subjects = ['🧘', '🧘‍♂️', '🧘‍♀️', '🧘🏻', '🧘🏻‍♂️', '🧘🏻‍♀️', '🧘🏼', '🧘🏼‍♂️', '🧘🏼‍♀️', '🧘🏽', '🧘🏽‍♂️', '🧘🏽‍♀️', '🧘🏾', '🧘🏾‍♂️', '🧘🏾‍♀️', '🧘🏿', '🧘🏿‍♂️', '🧘🏿‍♀️',]
// @todo Add these to emojis
const hieroglyphs = ['𓀀','𓀁','𓀂','𓀃','𓀄','𓀅','𓀆','𓀇','𓀈','𓀉','𓀊','𓀋','𓀌','𓀍','𓀎','𓀏','𓀐','𓀑','𓀒','𓀓','𓀔','𓀕','𓀖','𓀗','𓀘','𓀙','𓀚','𓀛','𓀜','𓀝','𓀞','𓀟','𓀠','𓀡','𓀢','𓀣','𓀤','𓀥','𓀦','𓀧','𓀨','𓀩','𓀪','𓀫','𓀬','𓀭','𓀮','𓀯','𓀰','𓀱','𓀲','𓀳','𓀴','𓀵','𓀶','𓀷','𓀸','𓀹','𓀺','𓀻','𓀼','𓀽','𓀾','𓀿','𓁀','𓁁','𓁂','𓁃','𓁄','𓁅','𓁆','𓁇','𓁈','𓁉','𓁊','𓁋','𓁌','𓁍','𓁎','𓁏','𓁐','𓁑','𓁒','𓁓','𓁔','𓁕','𓁖','𓁗','𓁘','𓁙','𓁚','𓁛','𓁜','𓁝','𓁞','𓁟','𓁠','𓁡','𓁢','𓁣','𓁤','𓁥','𓁦','𓁧','𓁨','𓁩','𓁪','𓁫','𓁬','𓁭','𓁮','𓁯','𓁰','𓁱','𓁲','𓁳','𓁴','𓁵','𓁶','𓁷','𓁸','𓁹','𓁺','𓁻','𓁼','𓁽','𓁾','𓁿','𓂀','𓂁','𓂂','𓂃','𓂄','𓂅','𓂆','𓂇','𓂈','𓂉','𓂊','𓂋','𓂌','𓂍','𓂎','𓂏','𓂐','𓂑','𓂒','𓂓','𓂔','𓂕','𓂖','𓂗','𓂘','𓂙','𓂚','𓂛','𓂜','𓂝','𓂞','𓂟','𓂠','𓂡','𓂢','𓂣','𓂤','𓂥','𓂦','𓂧','𓂨','𓂩','𓂪','𓂫','𓂬','𓂭','𓂮','𓂯','𓂰','𓂱','𓂲','𓂳','𓂴','𓂵','𓂶','𓂷','𓂸','𓂹','𓂺','𓂻','𓂼','𓂽','𓂾','𓂿','𓃀','𓃁','𓃂','𓃃','𓃄','𓃅','𓃆','𓃇','𓃈','𓃉','𓃊','𓃋','𓃌','𓃍','𓃎','𓃏','𓃐','𓃑','𓃒','𓃓','𓃔','𓃕','𓃖','𓃗','𓃘','𓃙','𓃚','𓃛','𓃜','𓃝','𓃞','𓃟','𓃠','𓃡','𓃢','𓃣','𓃤','𓃥','𓃦','𓃧','𓃨','𓃩','𓃪','𓃫','𓃬','𓃭','𓃮','𓃯','𓃰','𓃱','𓃲','𓃳','𓃴','𓃵','𓃶','𓃷','𓃸','𓃹','𓃺','𓃻','𓃼','𓃽','𓃾','𓃿','𓄀','𓄁','𓄂','𓄃','𓄄','𓄅','𓄆','𓄇','𓄈','𓄉','𓄊','𓄋','𓄌','𓄍','𓄎','𓄏','𓄐','𓄑','𓄒','𓄓','𓄔','𓄕','𓄖','𓄗','𓄘','𓄙','𓄚','𓄛','𓄜','𓄝','𓄞','𓄟','𓄠','𓄡','𓄢','𓄣','𓄤','𓄥','𓄦','𓄧','𓄨','𓄩','𓄪','𓄫','𓄬','𓄭','𓄮','𓄯','𓄰','𓄱','𓄲','𓄳','𓄴','𓄵','𓄶','𓄷','𓄸','𓄹','𓄺','𓄻','𓄼','𓄽','𓄾','𓄿','𓅀','𓅁','𓅂','𓅃','𓅄','𓅅','𓅆','𓅇','𓅈','𓅉','𓅊','𓅋','𓅌','𓅍','𓅎','𓅏','𓅐','𓅑','𓅒','𓅓','𓅔','𓅕','𓅖','𓅗','𓅘','𓅙','𓅚','𓅛','𓅜','𓅝','𓅞','𓅟','𓅠','𓅡','𓅢','𓅣','𓅤','𓅥','𓅦','𓅧','𓅨','𓅩','𓅪','𓅫','𓅬','𓅭','𓅮','𓅯','𓅰','𓅱','𓅲','𓅳','𓅴','𓅵','𓅶','𓅷','𓅸','𓅹','𓅺','𓅻','𓅼','𓅽','𓅾','𓅿','𓆀','𓆁','𓆂','𓆃','𓆄','𓆅','𓆆','𓆇','𓆈','𓆉','𓆊','𓆋','𓆌','𓆍','𓆎','𓆏','𓆐','𓆑','𓆒','𓆓','𓆔','𓆕','𓆖','𓆗','𓆘','𓆙','𓆚','𓆛','𓆜','𓆝','𓆞','𓆟','𓆠','𓆡','𓆢','𓆣','𓆤','𓆥','𓆦','𓆧','𓆨','𓆩','𓆪','𓆫','𓆬','𓆭','𓆮','𓆯','𓆰','𓆱','𓆲','𓆳','𓆴','𓆵','𓆶','𓆷','𓆸','𓆹','𓆺','𓆻','𓆼','𓆽','𓆾','𓆿','𓇀','𓇁','𓇂','𓇃','𓇄','𓇅','𓇆','𓇇','𓇈','𓇉','𓇊','𓇋','𓇌','𓇍','𓇎','𓇏','𓇐','𓇑','𓇒','𓇓','𓇔','𓇕','𓇖','𓇗','𓇘','𓇙','𓇚','𓇛','𓇜','𓇝','𓇞','𓇟','𓇠','𓇡','𓇢','𓇣','𓇤','𓇥','𓇦','𓇧','𓇨','𓇩','𓇪','𓇫','𓇬','𓇭','𓇮','𓇯','𓇰','𓇱','𓇲','𓇳','𓇴','𓇵','𓇶','𓇷','𓇸','𓇹','𓇺','𓇻','𓇼','𓇽','𓇾','𓇿','𓈀','𓈁','𓈂','𓈃','𓈄','𓈅','𓈆','𓈇','𓈈','𓈉','𓈊','𓈋','𓈌','𓈍','𓈎','𓈏','𓈐','𓈑','𓈒','𓈓','𓈔','𓈕','𓈖','𓈗','𓈘','𓈙','𓈚','𓈛','𓈜','𓈝','𓈞','𓈟','𓈠','𓈡','𓈢','𓈣','𓈤','𓈥','𓈦','𓈧','𓈨','𓈩','𓈪','𓈫','𓈬','𓈭','𓈮','𓈯','𓈰','𓈱','𓈲','𓈳','𓈴','𓈵','𓈶','𓈷','𓈸','𓈹','𓈺','𓈻','𓈼','𓈽','𓈾','𓈿','𓉀','𓉁','𓉂','𓉃','𓉄','𓉅','𓉆','𓉇','𓉈','𓉉','𓉊','𓉋','𓉌','𓉍','𓉎','𓉏','𓉐','𓉑','𓉒','𓉓','𓉔','𓉕','𓉖','𓉗','𓉘','𓉙','𓉚','𓉛','𓉜','𓉝','𓉞','𓉟','𓉠','𓉡','𓉢','𓉣','𓉤','𓉥','𓉦','𓉧','𓉨','𓉩','𓉪','𓉫','𓉬','𓉭','𓉮','𓉯','𓉰','𓉱','𓉲','𓉳','𓉴','𓉵','𓉶','𓉷','𓉸','𓉹','𓉺','𓉻','𓉼','𓉽','𓉾','𓉿','𓊀','𓊁','𓊂','𓊃','𓊄','𓊅','𓊆','𓊇','𓊈','𓊉','𓊊','𓊋','𓊌','𓊍','𓊎','𓊏','𓊐','𓊑','𓊒','𓊓','𓊔','𓊕','𓊖','𓊗','𓊘','𓊙','𓊚','𓊛','𓊜','𓊝','𓊞','𓊟','𓊠','𓊡','𓊢','𓊣','𓊤','𓊥','𓊦','𓊧','𓊨','𓊩','𓊪','𓊫','𓊬','𓊭','𓊮','𓊯','𓊰','𓊱','𓊲','𓊳','𓊴','𓊵','𓊶','𓊷','𓊸','𓊹','𓊺','𓊻','𓊼','𓊽','𓊾','𓊿','𓋀','𓋁','𓋂','𓋃','𓋄','𓋅','𓋆','𓋇','𓋈','𓋉','𓋊','𓋋','𓋌','𓋍','𓋎','𓋏','𓋐','𓋑','𓋒','𓋓','𓋔','𓋕','𓋖','𓋗','𓋘','𓋙','𓋚','𓋛','𓋜','𓋝','𓋞','𓋟','𓋠','𓋡','𓋢','𓋣','𓋤','𓋥','𓋦','𓋧','𓋨','𓋩','𓋪','𓋫','𓋬','𓋭','𓋮','𓋯','𓋰','𓋱','𓋲','𓋳','𓋴','𓋵','𓋶','𓋷','𓋸','𓋹','𓋺','𓋻','𓋼','𓋽','𓋾','𓋿','𓌀','𓌁','𓌂','𓌃','𓌄','𓌅','𓌆','𓌇','𓌈','𓌉','𓌊','𓌋','𓌌','𓌍','𓌎','𓌏','𓌐','𓌑','𓌒','𓌓','𓌔','𓌕','𓌖','𓌗','𓌘','𓌙','𓌚','𓌛','𓌜','𓌝','𓌞','𓌟','𓌠','𓌡','𓌢','𓌣','𓌤','𓌥','𓌦','𓌧','𓌨','𓌩','𓌪','𓌫','𓌬','𓌭','𓌮','𓌯','𓌰','𓌱','𓌲','𓌳','𓌴','𓌵','𓌶','𓌷','𓌸','𓌹','𓌺','𓌻','𓌼','𓌽','𓌾','𓌿','𓍀','𓍁','𓍂','𓍃','𓍄','𓍅','𓍆','𓍇','𓍈','𓍉','𓍊','𓍋','𓍌','𓍍','𓍎','𓍏','𓍐','𓍑','𓍒','𓍓','𓍔','𓍕','𓍖','𓍗','𓍘','𓍙','𓍚','𓍛','𓍜','𓍝','𓍞','𓍟','𓍠','𓍡','𓍢','𓍣','𓍤','𓍥','𓍦','𓍧','𓍨','𓍩','𓍪','𓍫','𓍬','𓍭','𓍮','𓍯','𓍰','𓍱','𓍲','𓍳','𓍴','𓍵','𓍶','𓍷','𓍸','𓍹','𓍺','𓍻','𓍼','𓍽','𓍾','𓍿','𓎀','𓎁','𓎂','𓎃','𓎄','𓎅','𓎆','𓎇','𓎈','𓎉','𓎊','𓎋','𓎌','𓎍','𓎎','𓎏','𓎐','𓎑','𓎒','𓎓','𓎔','𓎕','𓎖','𓎗','𓎘','𓎙','𓎚','𓎛','𓎜','𓎝','𓎞','𓎟','𓎠','𓎡','𓎢','𓎣','𓎤','𓎥','𓎦','𓎧','𓎨','𓎩','𓎪','𓎫','𓎬','𓎭','𓎮','𓎯','𓎰','𓎱','𓎲','𓎳','𓎴','𓎵','𓎶','𓎷','𓎸','𓎹','𓎺','𓎻','𓎼','𓎽','𓎾','𓎿','𓏀','𓏁','𓏂','𓏃','𓏄','𓏅','𓏆','𓏇','𓏈','𓏉','𓏊','𓏋','𓏌','𓏍','𓏎','𓏏','𓏐','𓏑','𓏒','𓏓','𓏔','𓏕','𓏖','𓏗','𓏘','𓏙','𓏚','𓏛','𓏜','𓏝','𓏞','𓏟','𓏠','𓏡','𓏢','𓏣','𓏤','𓏥','𓏦','𓏧','𓏨','𓏩','𓏪','𓏫','𓏬','𓏭','𓏮','𓏯','𓏰','𓏱','𓏲','𓏳','𓏴','𓏵','𓏶','𓏷','𓏸','𓏹','𓏺','𓏻','𓏼','𓏽','𓏾','𓏿','𓐀','𓐁','𓐂','𓐃','𓐄','𓐅','𓐆','𓐇','𓐈','𓐉','𓐊','𓐋','𓐌','𓐍','𓐎','𓐏','𓐐','𓐑','𓐒','𓐓','𓐔','𓐕','𓐖','𓐗','𓐘','𓐙','𓐚','𓐛','𓐜','𓐝','𓐞','𓐟','𓐠','𓐡','𓐢','𓐣','𓐤','𓐥','𓐦','𓐧','𓐨','𓐩','𓐪','𓐫','𓐬','𓐭','𓐮','',]

Layers.create(() => {

  // Size of emoji
  const size = minSize * .65

  new Layer({
    id: 'main',
    noLoop: true,
    colors: [
      // Limestone base
      '#eee2c7',
      // Dark Green
      '#003333'
    ],

    menu: {
      numEmojis: {
        min: 1,
        max: 3,
        reset: true
      },
    },

    store: {
      subjects: [],
    },

    setup () {
      textAlign(CENTER, CENTER)

      // Create main subjects
      $subjects = []
      for (let i = 0; i < $numEmojis; i++) {
        $subjects.push({
          emoji: random(subjects),
          eyeHeight: random(1),
          mouthHeight: random(1),
          eyes: random() > .5 ? '👁️' : '👁️👁️',
        })
      }
    },
    
    draw () {
      let size = minSize * .4
      clear()
      
      push()
      translate(size*.5, height/1.8)
      textStyle(NORMAL)

      // Draw Subjects
      $subjects.forEach(subject => {
        drawingContext.shadowBlur = 0
        textSize(size)
        text(subject.emoji, 0, 0)
        let newSize = size

        // body
        drawingContext.shadowBlur = 5
        drawingContext.shadowColor = '#000'
        for (let i = 0; i < 20; i++) {
          newSize -= newSize * .1
          textSize(newSize)
          text(subject.emoji, 0, 0)
        }

        // face
        textSize(size*.2)
        text(subject.eyes, 0, -subject.eyeHeight*size*.4)
        text('👄', 0, -subject.eyeHeight*size*.2 + subject.mouthHeight*size*.4)

        translate(size * .9, 0)
      })

      // Draw hieroglyphs
      drawingContext.shadowBlur = 0
      let remainingSpace = width - size*$subjects.length
      translate(0, -height/3)
      textStyle(BOLD)
      strokeWeight(minSize*.005)
      
      if (remainingSpace > size*.5) {
        // Column
        for (let x = 0; x < remainingSpace/size-.3; x+=.5) {
          fill(this.colors[1])
          stroke(this.colors[1])
          rect(size*x-size*.25, -size*.2, size*.01, height*.7)
          
          // Row
          for (let y = 0; y < height/size+.5; y+=.5) {
            let glyph = random(hieroglyphs)
            textSize(size*.3)

            // light
            fill('#fff')
            stroke('#fff')
            text(glyph, x*size - size*.01, y*(size*.5) - size*.01)
            
            // Shadow
            fill('#000')
            stroke('#000')
            text(glyph, x*size + size*.01, y*(size*.5) + size*.01)            
            
            // Carving
            fill(this.colors[1])
            stroke(this.colors[1])
            text(glyph, x*size, y*(size*.5))
          }
        }
      }

      pop()

      // Apply noise
      let noiseAmount = 200
      let x = 0
      let y = 0

      // First pass (perlin noise)
      loadPixels()

      for (let i = 0; i < pixels.length; i+=4) {
        if (pixels[i+3] > 0) {
          pixels[i] += noiseAmount - noise(x*.1, y*.1) * noiseAmount*2
          pixels[i+1] += noiseAmount - noise(x*.1, y*.1) * noiseAmount*2
          pixels[i+2] += noiseAmount - noise(x*.1, y*.1) * noiseAmount*2
          x++
          if (x > width) {
            x = 0
            y++
          }
        }
      }
    
      // Second pass (roughgen)
      noiseAmount = 50
      for (let i = 0; i < pixels.length; i+=4) {
        if (pixels[i+3] > 0) {
          pixels[i] += noiseAmount - noise(i*.1) * noiseAmount*2
          pixels[i+1] += noiseAmount - noise(i*.1) * noiseAmount*2
          pixels[i+2] += noiseAmount - noise(i*.1) * noiseAmount*2
          x++
          if (x > width) {
            x = 0
            y++
          }
        }
      }
    
      // Third pass (random)
      noiseAmount = 25
      for (let i = 0; i < pixels.length; i+=4) {
        if (pixels[i+3] > 0) {
          pixels[i] += random(-noiseAmount, noiseAmount)
          pixels[i+1] += random(-noiseAmount, noiseAmount)
          pixels[i+2] += random(-noiseAmount, noiseAmount)
          x++
          if (x > width) {
            x = 0
            y++
          }
        }
      }

      updatePixels()
    }
  })
})
}

